<template>
  <b-container>
    <b-modal id="personalInfo" ref="personalInfo" centered hide-footer>
      <div class="container">
        <div class="terms">
          <h1>개인 정보처리 방침</h1>
          <p>
            FITCHOO는 통신비밀 보호법, 전기통신사업법, 정보통신망 이용 촉진 및
            정보보호 등에 관한 법률 등 정보통신서비스 제공자가 준수하여야 할
            관련 법령상의 개인 정보보호 규정을 준수하며, 관련 법령에 의거한 개인
            정보취급방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다.
            회사의 개인 정보취급방침은 다음과 같은 내용을 담고 있습니다.
          </p>

          <h5>제1조 회사가 수집하고 있는 이용자의 개인 정보</h5>

          <p>수집하는 개인 정보의 항목</p>
          <ol>
            <li>
              이름, E-Mail 주소, 비밀번호, 등의 정보는 회사의 개인 정보 취급
              방침을 동의하는 경우 수집됩니다.
            </li>
            <li>
              서비스 이용을 위해 회원이 작성한 신체 사이즈, 실측 사이즈 정보는,
              회사의 개인 정보 취급 방침을 동의하는 경우 수집 및 게재됩니다.
            </li>
          </ol>
          <p>
            회사에서는 아래의 항목들에 대해서도 안정된 서비스 제공을 위해
            합법적인 절차와 회원의 동의를 거쳐 추가로 수집할 수 있습니다.
          </p>
          <ol>
            <li>IP 주소, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록</li>
            <li>사용중인 이동통신사, 계좌번호 등</li>
            <li>신용카드 결제 시 : 카드사명, 카드번호 등</li>
            <li>휴대전화 결제 시 : 이동전화번호, 통신사, 결제 승인 번호 등</li>
            <li>계좌이체로 결제 시 : 은행명, 계좌번호 등</li>
            <li>상품권 이용 시 : 상품권 번호 등</li>
          </ol>
          <p>개인 정보 수집방법</p>
          <ol>
            <li>홈페이지, 서면 양식, 팩스, 전화, 이메일, 이벤트 응모</li>
            <li>협력회사로부터 공동 제휴 및 협력을 통한 정보 수집</li>
            <li>생성 정보 수집 툴을 통한 정보 수집</li>
          </ol>

          <h5>제2조 회사의 개인 정보의 수집 및 이용목적</h5>

          <p>서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금 정산</p>
          <ol>
            <li>
              콘텐츠 제공, 특정 맞춤 서비스 제공, 본인인증, 구매 및 요금 결제,
              요금 추심
            </li>
          </ol>
          <p>회원관리</p>
          <ol>
            <li>
              회원제 서비스 이용 및 인증 서비스에 따른 본인확인, 개인식별, 부정
              이용방지와 비인가 사용 방지, 가입 의사 확인, 가입 및 가입 횟수
              제한, 분쟁 조정을 위한 기록 보존, 추후 법정 대리인 본인확인 불만
              처리 등 민원처리, 고지사항 전달
            </li>
          </ol>
          <p>신규 서비스 개발 및 마케팅, 광고에의 활용</p>
          <ol>
            <li>
              신규 서비스 개발 및 인증 서비스 제공, 통계학적 특성에 따른 서비스
              제공 및 광고 게재, 이벤트 및 광고성 정보 제공 및 참여 기회 제공,
              접속 빈도 파악, 회원의 서비스 이용에 대한 통계, 서비스의 유효성
              확인 이벤트 및 광고성 정보제공 및 참여 기회 제공
            </li>
          </ol>

          <h5>제3조 회사에서 개인 정보를 수집하는 방법</h5>

          <p>
            「회사」 안에서 모든 회원이 서비스를 제공받기 위해서는 회원님의 개인
            정보가 필요하며 정보수집은 회원가입 시 회원가입양식 혹은 서비스 이용
            중에 사용자의 동의를 통해 개인 정보를 수집합니다.
          </p>

          <h5>제4조 개인 정보의 취급위탁</h5>

          <p>
            회사의 서비스 향상 및 안정적인 개인 정보 취급을 위해서 귀하의 개인
            정보를 외부에 위탁하여 처리할 수 있습니다.
          </p>
          <ol>
            <li>
              개인 정보의 처리를 위탁하는 경우에는 미리 그 사실을 귀하에게
              고지하겠습니다.
            </li>
            <li>
              개인 정보의 처리를 위탁하는 경우에는 위탁계약 등을 통하여 서비스
              제공자의 개인 정보보호 관련 지시엄수, 개인 정보에 관한 비밀유지,
              제3자 제공의 금지 및 사고시의 책임부담 등을 명확히 규정하고 당해
              계약내용을 서면 또는 전자적으로 보관하겠습니다.
            </li>
          </ol>
          <h5>제5조 개인 정보의 보유 및 이용기간</h5>
          <p>
            회원의 개인 정보는 회원가입 후 서비스 이용 기간이 종료되거나 회원이
            계약해지, 탈퇴 등의 사유로 이메일이나 서면을 통해 개인 정보 삭제를
            요구하는 경우에는 제3자의 열람과 이용이 불가능한 상태로 처리되며,
            ‘전자상거래 등에서의 소비자보호에 관한 법률’ 제6조(거래 기록의 보존
            등), 정보통신 이용 촉진 및 정보보호 등에 관한 법률에 의하여 아래의
            명시 기간 동안 보관관리 합니다.
          </p>

          <ol>
            <li>계약, 청약철회, 회원서비스 제공 등의 거래에 관한 기록 : 5년</li>
            <li>대금 결제 및 재화 등의 공급에 관한 기록 : 5년</li>
            <li>대소비자 불만 또는 분쟁처리에 관한 기록 : 3년</li>
            <li>본인확인에 관한 기록 : 6개월</li>
            <li>방문에 관한 기록 : 3개월</li>
            <li>회사 내부 방침에 의한 정보 보유 사유</li>
            <ol>
              <li>부정 이용 기록</li>
              <li>보존 이유 : 부정 이용 방지</li>
              <li>보존 기간 : 3년</li>
            </ol>
          </ol>

          <h5>제6조 개인 정보 파기절차 및 방법</h5>
          <p>
            이용자의 개인 정보는 원칙적으로 개인 정보의 수집 및 이용목적이
            달성되면 지체 없이 파기합니다. 회사의 개인 정보 파기절차 및 방법은
            다음과 같습니다.
          </p>
          <p>파기 절차</p>
          <ol>
            <li>
              이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의
              DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련
              법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조)일정 기간
              저장된 후 파기됩니다.
            </li>
            <li>
              개인 정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른
              목적으로 이용되지 않습니다.
            </li>
          </ol>

          <p>파기 방법</p>

          <ol>
            <li>
              종이에 출력된 개인 정보는 분쇄기로 분쇄하거나 소각을 통하여
              파기합니다.
            </li>
            <li>
              전자적 파일 형태로 저장된 개인 정보는 기록을 재생할 수 없는 기술적
              방법을 사용하여 삭제합니다.
            </li>
          </ol>
          <h5>제7조 회사의 이용자 개인 정보 정확성을 위한 내용</h5>
          <p>
            「회사」은 회원이 최선의 개인 정보로 상태로 유지하도록 정기적으로
            갱신을 유도합니다. 일부 정보에 대해서는 「회사」에서 정기적으로
            확인작업이 이루어 집니다. 이용자의 부정확한 개인 정보로 인하여
            사용상의 불편을 줄 수 있으므로 개인 정보 관리자가 판단하기에 확연히
            부정확한 개인 정보를 기입한 경우에는 정확하지 않은 개인 정보를
            파기할 수 있습니다.
          </p>
          <h5>
            제8조 회사은 이용자의 개인 정보안전을 위하여 서비스를 일시적으로
            중단할 수 있습니다.
          </h5>

          <p>
            「회사」은 이용자의 안전한 서비스 이용을 위해서 최선을 다하고
            있습니다. 그러나, 원하지 않는 방법에 의하여 저희의 서비스가 훼손을
            당하는 경우에는 이용자들의 개인 정보의 보호를 위하여, 문제가
            완전하게 해결될 때까지 이용자의 개인 정보를 이용한 서비스를 일시
            중단 할 수도 있습니다.
          </p>
          <h5>제9조 회사의 제 3 자와의 정보공유 및 제공 관련</h5>
          <p>
            「회사」은 개인 정보보호지침 제8조(이용 및 제공의 제한)에 따라
            이용자의 개인 정보를 제7조의 규정에 의하여 고지 또는 명시한 범위를
            초과하여 이용하거나 제3자에게 제공하지 않습니다. 또한 「회사」은
            개인 정보보호지침 제 12조 비밀 유지안에 따라 서비스의 제공을 위하여
            이용자의 개인 정보를 취급하거나 취급하였던 자는 직무상 알게 된 개인
            정보를 타인에게 누설하거나 제공하지 않습니다.
          </p>
          <h5>제10조 회사의 이용자의 개인 정보 비밀유지를 위한 내용</h5>
          「회사」은 이용자의 개인 정보의 비밀을 유지하기 위하여 제3자에게는
          이용자의 동의 없이 개인 정보를 유출하지 않습니다. 또한 이용자가 동의를
          하였다 하더라도, 제3자를 통하여 재유출이 될 확률이 있는 자에게는
          이용자의 개인 정보를 유출하지 않습니다. 「회사」은 각종정부기관의
          이용자 개인 정보의 일방적 제공 요구에 대하여는 이용자의 개인 정보를
          제공하지 않습니다. 공식적인 정부기관의 절차를 완벽하게 이행한
          자료요구에 대하여 만 이용자의 개인 정보를 제공합니다. 「회사」은
          이용자의 개인 정보를 회사가 정한 기본서비스 및 기타의 서비스
          활동이외에는 이용하지 않습니다. 위의 활동에 따라 이용자의 정보가
          필요할 시에는 별도의 양식을 통한 수집 및 동의의 절차를 거쳐서 이용자의
          개인 정보를 이용합니다.
          <h5>
            제11조 회사 회원들이 자신의 개인 정보를 보호하기 위해 알아야 할 사항
          </h5>
          <p>
            PC방 등 외부 장소에서 「회사」을 사용하실 경우 완전히 로그아웃 하신
            후 웹 브라우저의 창을 닫아 주십시오. 정상적으로 로그아웃을 하시지
            않은 경우 회원님의 정보가 고스란히 남을 수 있습니다. 「회사」은 개인
            정보 보호에 최선을 다하지만 사용자 개인의 실수나 인터넷 상의 문제로
            인한 일들에 대해서는 책임을 지지 않습니다. 이 점 양해해 주시면
            감사하겠습니다.
          </p>
          <h5>
            제12조 회사가 인지 못한 이용자의 개인 정보 및 기타의 불만사항에 관한
            처리
          </h5>
          <p>
            「회사」이 인지하지 못하고 있는 이용자의 개인 정보 이용 및 기타의
            불만사항에 관하여 이용자 불만 처리를 전담하는 관리자를 배정하여
            지속적이고, 신속하게 이용자의 불만사항을 처리하고, 처리한 결과에
            대하여 즉시 응대합니다.
          </p>
          <h5>제13조 회사의 개인 정보 취급자의 제한에 관한 내용</h5>
          <p>
            「회사」은 이용자의 개인 정보를 취급할 권한이 있는 제한된 소수의
            직원에게만 권한을 부여하고, 취급 권한을 가진 직원들에게는 개인
            아이디(ID)와 Password를 부여하고, 이를 매일 또는 수시로 변경하여
            이용자의 개인 정보를 보호하는데 최선을 다합니다.
          </p>
          <h5>제14조 이용자 및 법정 대리인의 권리와 그 행사 방법</h5>
          <p>
            이용자 및 법정 대리인은 언제든지 등록되어 있는 자신의 개인 정보를
            조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다.
          </p>
          <p>
            회원의 개인 정보 조회, 수정을 위해서는 '개인 정보 변경'(또는 '회원
            정보 수정' 등)을, 가입해지(동의 철회)를 위해서는 "탈퇴하기"를
            클릭하여 가입해지 및 탈퇴가 가능합니다.
          </p>
          <p>
            혹은 고객센터나 개인 정보책임자로 서면, 전화 또는 이메일로
            연락하시면 지체 없이 조치하겠습니다.
          </p>
          <p>
            이용자가 개인 정보의 오류에 대한 정정을 요청하신 경우에는 정정을
            완료하기 전까지 당해 개인 정보를 이용 또는 제공하지 않습니다. 또한
            잘못된 개인 정보를 제3 자에게 이미 제공한 경우에는 정정 처리결과를
            제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.
          </p>

          <p>
            회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인
            정보는 개인 정보취급방침 "5.개인 정보의 보유 및 이용기간"에 명시된
            바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록
            처리하고 있습니다.
          </p>

          <h5>
            제15조 개인 정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항
          </h5>
          <p>
            회사는 이용자들에게 특화된 맞춤 서비스를 제공하기 위해서 이용자들의
            정보를 저장하고 수시로 불러오는 '쿠키(cookie)'를 사용합니다. 쿠키는
            웹사이트를 운영하는데 이용되는 서버(HTTP)가 이용자의 컴퓨터
            브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의
            하드디스크에 저장되기도 합니다.
          </p>
          <p>쿠키의 사용 목적</p>

          <ol>
            <li>
              이용자들의 로그인 및 최근접속기록을 토대로 회사 유저간 상호
              커뮤니케이션 시의 편리한 기능을 제공하기 위하여 활용됩니다.
            </li>
          </ol>
          <p>쿠키의 설치/운영 및 거부</p>

          <ol>
            <li>
              이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서,
              이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를
              허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든
              쿠키의 저장을 거부할 수도 있습니다.
            </li>
            <li>
              쿠키 설정을 거부하는 방법으로는 이용자가 사용하는 웹 브라우저의
              옵션을 선택함으로써 모든 쿠키를 허용하거나 쿠키를 저장할 때마다
              확인을 거치거나, 모든 쿠키의 저장을 거부할 수 있습니
            </li>
            <li>
              설정방법 예(인터넷 익스플로어의 경우) : 웹 브라우저 상단의 도구 >
              인터넷 옵션 > 개인 정보
            </li>
            <li>
              다만, 쿠키의 저장을 거부할 경우에는 이용에 어려움이 있을 수
              있습니다.
            </li>
          </ol>

          <h5>제16조 개인 정보 관리 책임자 및 담당자의 연락처</h5>

          <p>
            귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인 정보보호
            관련 민원을 개인 정보 관리 담당자 혹은 담당부서로 신고하실 수
            있습니다. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을
            드릴 것입니다.
          </p>

          <p>
            <b>개인 정보 관리 책임자</b>
          </p>

          <p>이 름 : 유재원</p>
          <p>직 위 : 관리책임/담당자</p>
          <p>전 화 : 010-3662-1352</p>
          <p>메 일 : won@fitchoo.kr</p>
          <p>
            기타 개인 정보침해에 대한 신고나 상담이 필요하신 경우에는 아래
            기관에 문의하시기 바랍니다. - 개인 정보침해신고센터 (www.118.or.kr /
            118) - 정보보호마크인증위원회 (www.eprivacy.or.kr / 02-580-0533~4) -
            대검찰청 첨단범죄수사과 (www.spo.go.kr / 02-3480-2000) - 경찰청
            사이버테러대응센터 (www.ctrc.go.kr / 02-392-0330)
          </p>
          <h5>부칙</h5>
          <p>이 약관은 2019년 2월 20일부터 유효합니다.</p>
        </div>
      </div>
    </b-modal>
  </b-container>
</template>

<style scoped lang="scss">
.terms {
  overflow: scroll;
  height: 60vh;
  margin-bottom: 1em;
  letter-spacing: -1;
  line-height: 1.5em;
  word-break: keep-all;
  word-wrap: break-word;
  h1 {
    font-weight: bold;
    padding-bottom: 1em;
    font-size: 1.7em;
    text-align: center;
  }
  h4 {
    font-size: 1.4em;
    padding: 0.5em 0;
  }
  h5 {
    font-size: 1.1em;
    padding: 0.8em 0;
  }
  p {
    font-size: 0.9em;
  }
  ol {
    li {
      font-size: 0.9em;
    }
  }
}
</style>
